In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from sklearn.preprocessing import LabelEncoder

In [2]:
DATA_PATH = 'E:/Edureka_Python-Course/Data Sources/Day_11/'

In [3]:
d1 = pd.read_csv(DATA_PATH+'BX-Book-Ratings.csv', encoding='ISO-8859–1', low_memory=False)
d2= pd.read_csv(DATA_PATH+'BX-Books.csv', encoding='ISO-8859–1', low_memory=False)
d3= pd.read_csv(DATA_PATH+'BX-Users.csv', encoding='ISO-8859–1', low_memory=False)

In [4]:
d1.head().transpose()

                  0          1          2           3          4
user_id      276725     276726     276727      276729     276729
isbn     034545104X  155061224  446520802  052165615X  521795028
rating            0          5          0           3          6

In [5]:
d2.head().transpose()

,0,1,2,3,4
isbn,195153448,2005018,60973129,374157065,393045218
book_title,Classical Mythology,Clara Callan,Decision in Normandy,Flu: The Story of the Great Influenza Pandemic...,The Mummies of Urumchi
book_author,Mark P. O. Morford,Richard Bruce Wright,Carlo D'Este,Gina Bari Kolata,E. J. W. Barber
year_of_publication,2002,2001,1991,1999,1999
publisher,Oxford University Press,HarperFlamingo Canada,HarperPerennial,Farrar Straus Giroux,W. W. Norton &amp; Company

In [6]:
d3.head().transpose()

,0,1,2,3,4
user_id,1,2,3,4,5
Location,"nyc, new york, usa","stockton, california, usa","moscow, yukon territory, russia","porto, v.n.gaia, portugal","farnborough, hants, united kingdom"
Age,NaN,18,NaN,17,NaN

In [7]:
dfs = [d1,d2,d3]

In [8]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   user_id  1048575 non-null  int64
 1   isbn     1048575 non-null  object
 2   rating   1048575 non-null  int64
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [9]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271379 entries, 0 to 271378
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   isbn                 271379 non-null  object
 1   book_title           271379 non-null  object
 2   book_author          271378 non-null  object
 3   year_of_publication  271379 non-null  object
 4   publisher            271377 non-null  object
dtypes: object(5)
memory usage: 10.4+ MB

In [10]:
d3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278859 entries, 0 to 278858
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   278859 non-null  object
 1   Location  278858 non-null  object
 2   Age       168096 non-null  float64
dtypes: float64(1), object(2)
memory usage: 6.4+ MB

In [11]:
sorted(d1.isbn) ==sorted(d2.isbn)

False

In [12]:
len(d3.Location.unique())

57340

In [13]:
pd.concat([d3, d1], join='inner', keys='user_id')

          user_id
u 0             1
  1             2
  2             3
  3             4
  4             5
...           ...
s 1048570  250764
  1048571  250764
  1048572  250764
  1048573  250764
  1048574  250764

[1327434 rows x 1 columns]

In [14]:
d1['user_id'] = d1['user_id'].astype('object')

In [15]:
min(d1.user_id)

2

In [16]:
'X' in str(d1.iloc[0,1])

True

In [17]:
d1.iloc[0,1]

'034545104X'

In [18]:
merged_df = (d1.merge(d3, how='left', on='user_id', sort=True,)).merge(d2,how='left', on='isbn', sort=True,)

In [19]:
merged_df.head().transpose()

,0,1,2,3,4
user_id,89192,65520,199864,194500,124304
isbn,904492401X,#069580216X,#6612432,(THEWINDMILLP,)416195113
rating,0,0,5,0,8
Location,NaN,NaN,NaN,NaN,NaN
Age,NaN,NaN,NaN,NaN,NaN
book_title,NaN,NaN,NaN,NaN,NaN
book_author,NaN,NaN,NaN,NaN,NaN
year_of_publication,NaN,NaN,NaN,NaN,NaN
publisher,NaN,NaN,NaN,NaN,NaN

In [20]:
merged_df.drop(['book_title'], axis=1, inplace=True)
merged_df.head().transpose()

,0,1,2,3,4
user_id,89192,65520,199864,194500,124304
isbn,904492401X,#069580216X,#6612432,(THEWINDMILLP,)416195113
rating,0,0,5,0,8
Location,NaN,NaN,NaN,NaN,NaN
Age,NaN,NaN,NaN,NaN,NaN
book_author,NaN,NaN,NaN,NaN,NaN
year_of_publication,NaN,NaN,NaN,NaN,NaN
publisher,NaN,NaN,NaN,NaN,NaN

In [21]:
merged_df.isnull().sum()/merged_df.shape[0]

user_id                0.000000
isbn                   0.000000
rating                 0.000000
Location               1.000000
Age                    1.000000
book_author            0.102451
year_of_publication    0.102450
publisher              0.102452
dtype: float64

In [22]:
d3.isnull().sum()/d3.shape[0]

user_id     0.000000
Location    0.000004
Age         0.397201
dtype: float64

In [23]:
merged_df.drop(['Location', 'Age',], axis=1, inplace=True)

In [24]:
def create_labels(df):
    labelEncoders = {}
    fitted_labelEncoders = {}
    cols = df.columns
    for col in cols:
        labelEncoders[col]= LabelEncoder()
        fitted_labelEncoders[col] : labelEncoders[col].fit(df[col])
    return labelEncoders

In [25]:
merged_df.isnull().sum()/merged_df.shape[0]

user_id                0.000000
isbn                   0.000000
rating                 0.000000
book_author            0.102451
year_of_publication    0.102450
publisher              0.102452
dtype: float64

In [26]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1048575 entries, 0 to 1048574
Data columns (total 6 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   user_id              1048575 non-null  object
 1   isbn                 1048575 non-null  object
 2   rating               1048575 non-null  int64
 3   book_author          941147 non-null   object
 4   year_of_publication  941148 non-null   object
 5   publisher            941146 non-null   object
dtypes: int64(1), object(5)
memory usage: 56.0+ MB

In [27]:
df_reduced = merged_df.iloc[:100000,:]

In [28]:
df_reduced.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   user_id              100000 non-null  object
 1   isbn                 100000 non-null  object
 2   rating               100000 non-null  int64
 3   book_author          91862 non-null   object
 4   year_of_publication  91862 non-null   object
 5   publisher            91862 non-null   object
dtypes: int64(1), object(5)
memory usage: 5.3+ MB

In [29]:
merged_df.user_id

0           89192
1           65520
2          199864
3          194500
4          124304
            ...
1048570    191707
1048571     87746
1048572    107301
1048573    107301
1048574     85250
Name: user_id, Length: 1048575, dtype: object

In [30]:
pd.to_numeric(merged_df.user_id)

0           89192
1           65520
2          199864
3          194500
4          124304
            ...
1048570    191707
1048571     87746
1048572    107301
1048573    107301
1048574     85250
Name: user_id, Length: 1048575, dtype: int64

In [31]:
len(merged_df.user_id.unique())

95513